WebService/app/controllers/password_resets_controller.rb

SELECT "users".id FROM "users" WHERE (LOWER("users"."email") = 'email_2@domain.com') LIMIT 1
---
  def create
    @user = User.find_by_email(params[:user][:email])

SELECT * FROM `users` WHERE (perishable_token = '6VK2vL9Nz97OSDjh6UXF' and updated_at > '2010-03-14 14:37:15') LIMIT 1
INSERT INTO "users" ("updated_at", "crypted_password", "perishable_token", "password_salt", "persistence_token", "email", "created_at") VALUES('2010-03-10 12:22:52', 'e2b197941e20ae757006ed742ae99d3f810079ac1343c8ab8738a285b754c643878095953da25dedb564ae3e006e959acde27f42d373fcae758a85359c3a3cc4', 'TR12EKyEllI7MMTonwnU', 'rwd_dGZ6vfGB7IiWO1zC', 'f549c70a5ca6dbfce79f8345f0acc35c6154b8b79a2f192f058c2a1d71b4598ae4cf60cf970dca808b346384b1989961a5448dfd21354ff8a21fdd7fc34d20c0', 'email_4@domain.com', '2010-03-10 12:22:52')
UPDATE `users` SET `persistence_token` = 'e99f8a2b7ad683b7ee1f906c01627b3a42e0331219d172279a5022238f308491c8eeb7ece230800627af7cbaca5913de90cf9531bdce60e7c02ad8ecb1c6f8fa', `perishable_token` = 'ZkRl2qcvHMDpaQiL5Rjy', `crypted_password` = '4bef99ba6bf729ac19dcd2c9d3076ba7977268d5073a1b01332b278d8cf8c500f4b4600988952472aac5a99e6d7e066c1fd47cd83be04560f8a1093d64cbc077', `updated_at` = '2010-03-14 16:37:15', `password_salt` = 'E78PrhIb4vzWmoDH46ol' WHERE `id` = 4
---
  def update
    if( !params[:user] || params[:user][:password].empty? )
      flash[:alert] = 'You have to fill the passwords fields'
      redirect_to edit_password_reset_path( params[:id] )
      return
    end

    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    if @user.save

SELECT * FROM `users` WHERE (perishable_token = 'hHTs4AEX9EeCjsvkt1yH' and updated_at > '2010-03-14 14:37:15') LIMIT 1
---
    def load_user_using_perishable_token
      @user = User.find_using_perishable_token(params[:id], 7200)