WebService/app/controllers/phixters_controller.rb

  def show
    @phixter = current_user.phixters.find(params[:id])
---
SELECT * FROM `phixters` WHERE (`phixters`.`id` = 35 AND (`phixters`.user_id = 115))

  def create
    @phixter = Phixter.new(params[:phixter])
    @phixter.user = current_user

    if @phixter.save
---
INSERT INTO "phixters" ("status", "uri", "updated_at", "value", "user_id", "hash_code", "created_at") VALUES(0, '10.10.10.10:1000', '2010-03-14 15:17:47', '1', 1, NULL, '2010-03-14 15:17:47')
INSERT INTO "users" ("updated_at", "crypted_password", "perishable_token", "password_salt", "persistence_token", "email", "created_at") VALUES('2010-03-14 15:57:42', '4d93fa08d390015fb3c65ed191cec86fbb06ed931ed084584802d9c638d291e3829bef69269c5e429e4e395d61827ecbf1215a61cee53ce10ea98083071f0531', 'nl2lfqx-6Uox6VoEf4c7', 'HK9ixi1luLiWNZy4NrhJ', '7df5861918f3f486c54ad18f6084f34f9a131ce7bbfebb9d88030ebaebbbc7ba4971fe621804bbf3717d616c579c5113330540f182b29cb3422399e50b251b01', 'email_2@domain.com', '2010-03-14 15:57:42')

  def destroy
    @phixter = current_user.phixters.find(params[:id])
    @phixter.destroy
---
SELECT * FROM `phixters` WHERE (`phixters`.`id` = 17 AND (`phixters`.user_id = 106))
DELETE FROM `phixters` WHERE `id` = 17

  def code
    @phixter = current_user.phixters.find(params[:id])
---
SELECT * FROM `phixters` WHERE (`phixters`.`id` = 3 AND (`phixters`.user_id = 7))

  def check
    @phixter = Phixter.find_by_hash_code(params[:id])
---
SELECT * FROM `phixters` WHERE (`phixters`.`hash_code` = '2ac831') LIMIT 1

  def send_signal
    @phixter = Phixter.find_by_hash_code(params[:id])
---
SELECT "phixters".id FROM "phixters" WHERE ("phixters"."hash_code" IS NULL) LIMIT 1

  def history
    @phixter = current_user.phixters.find(params[:id])
---
SELECT * FROM `phixters` WHERE (`phixters`.`id` = 20 AND (`phixters`.user_id = 109))