WebService/app/controllers/users_controller.rb

INSERT INTO `users` (`updated_at`, `crypted_password`, `perishable_token`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2010-03-14 16:37:15', NULL, 'yVmTBM6t3z5OLYDDYv0o', NULL, NULL, NULL, '2010-03-14 16:37:15')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `perishable_token` = '7ypcxUkE31GxGQ7J3S3j', `updated_at` = '2010-03-14 16:38:09' WHERE `id` = 31
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])

DELETE FROM `users` WHERE `id` = 28
---
  def destroy
    @user = current_user
    @user.destroy