WebService/app/controllers/user_sessions_controller.rb

INSERT INTO "users" ("updated_at", "crypted_password", "perishable_token", "password_salt", "persistence_token", "email", "created_at") VALUES('2010-03-14 16:20:27', '126ee8ddbbdf83369194d00ada2ed2db3d08db889f554c3fdcfd6000f3d7e774e702ea618f1a59abbe2d30e9944e9b5e14cc5b1e56049f5cd44daa301ca74f0e', 'LbkzJ7SCPnc3w3i82zmK', 'ryvr380tqr5karl8QjZX', '2d3c2730659a917bb73418dcc5f7ef278aff22ea106de3a1b0b3979efe46f367be6dc9964fe76245058136978d1f32ed0b99f67a31278d23ee8d329a1b2c3c0f', 'email_1@domain.com', '2010-03-14 16:20:27')
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save