WebApp/app/controllers/phixters_controller.rb

SELECT * FROM "phixters" WHERE ("phixters"."id" = 1)
---
  def show
    @phixter = current_user.phixters.find(params[:id])

INSERT INTO "phixters" ("status", "uri", "updated_at", "value", "user_id", "created_at") VALUES(0, 'fguillen.no-ip.org', '2010-03-08 18:24:51', '3', 1, '2010-03-08 18:24:51')
---
  def create
    @phixter = Phixter.new(params[:phixter])
    @phixter.user = current_user

    if @phixter.save

SELECT * FROM "phixters" WHERE ("phixters"."id" = 1)
UPDATE "phixters" SET "uri" = 'new_uri:2000', "updated_at" = '2010-03-06 20:51:46' WHERE "id" = 1
---
  def update
    @phixter = current_user.phixters.find(params[:id])
    if @phixter.update_attributes(params[:phixter])

SELECT * FROM "phixters" WHERE ("phixters"."id" = 1)
DELETE FROM "phixters" WHERE "id" = 1
---
  def destroy
    @phixter = current_user.phixters.find(params[:id])
    @phixter.destroy

SELECT * FROM "phixters" WHERE ("phixters"."id" = 1 AND ("phixters".user_id = 1))
---
  def code
    @phixter = current_user.phixters.find(params[:id])

SELECT * FROM "phixters" WHERE ("phixters"."id" = 1)
---
  def check
    @phixter = Phixter.find(params[:id])

SELECT * FROM "phixters" WHERE ("phixters"."id" = 3 AND ("phixters".user_id = 1))
---
  def history
    @phixter = current_user.phixters.find(params[:id])