WebApp/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "password_salt", "persistence_token", "email", "created_at") VALUES('2010-03-06 17:45:54', '8db1b8a26b3d100d94f15ffbc4ad13e1a221b804a58948fb7653526d42ef8c05793322dd20a7bcf3cedbe5c326bea48345838e459818e7198c92c0e37592f001', 'CQf1jLUVyFNGGqpEvcAC', '722a3c5b2b2630c9bd8866af352b191f25749dab75ac36b1bcefa729a7a216e0a2206de800f22298f031a7182e14809ab4446953fb9b53aac3428672c552d0be', 'gg@gg.com', '2010-03-06 17:45:54')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "email" = 'f4b@f.com', "updated_at" = '2010-03-06 18:56:28' WHERE "id" = 5